src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Wrk/wrkStandardExample1.txt
Running 1m test @ https://10.1.0.26/api_new/1kb
  2 threads and 20 connections
  Thread calibration: mean lat.: 4197.437ms, rate sampling interval: 15204ms
  Thread calibration: mean lat.: 4197.977ms, rate sampling interval: 15147ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.27s    12.10s   50.20s    57.59%
    Req/Sec     8.17k   163.44     8.32k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   29.56s 
 75.000%   39.75s 
 90.000%   45.97s 
 99.000%   49.74s 
 99.900%   50.17s 
 99.990%   50.23s 
 99.999%   50.23s 
100.000%   50.23s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8372.223     0.000000            2         1.00
   12525.567     0.100000        81614         1.11
   16605.183     0.200000       163195         1.25
   20660.223     0.300000       244674         1.43
   24805.375     0.400000       326214         1.67
   29556.735     0.500000       407688         2.00
   31604.735     0.550000       448517         2.22
   33619.967     0.600000       489638         2.50
   35618.815     0.650000       530556         2.86
   37683.199     0.700000       570904         3.33
   39747.583     0.750000       611770         4.00
   40796.159     0.775000       632420         4.44
   41811.967     0.800000       652450         5.00
   42827.775     0.825000       672721         5.71
   43876.351     0.850000       693461         6.67
   44892.159     0.875000       713577         8.00
   45449.215     0.887500       723987         8.89
   45973.503     0.900000       734157        10.00
   46497.791     0.912500       744472        11.43
   47054.847     0.925000       754722        13.33
   47579.135     0.937500       764883        16.00
   47841.279     0.943750       769668        17.78
   48103.423     0.950000       774858        20.00
   48365.567     0.956250       780158        22.86
   48627.711     0.962500       785303        26.67
   48857.087     0.968750       789786        32.00
   48988.159     0.971875       792512        35.56
   49119.231     0.975000       795257        40.00
   49250.303     0.978125       797991        45.71
   49381.375     0.981250       800387        53.33
   49512.447     0.984375       802822        64.00
   49577.983     0.985938       804076        71.11
   49643.519     0.987500       805311        80.00
   49709.055     0.989062       806567        91.43
   49774.591     0.990625       807793       106.67
   49840.127     0.992188       809006       128.00
   49872.895     0.992969       809631       142.22
   49905.663     0.993750       810256       160.00
   49938.431     0.994531       810831       182.86
   50003.967     0.995313       811970       213.33
   50036.735     0.996094       812575       256.00
   50036.735     0.996484       812575       284.44
   50069.503     0.996875       813155       320.00
   50069.503     0.997266       813155       365.71
   50102.271     0.997656       813642       426.67
   50135.039     0.998047       814120       512.00
   50135.039     0.998242       814120       568.89
   50135.039     0.998437       814120       640.00
   50167.807     0.998633       814706       731.43
   50167.807     0.998828       814706       853.33
   50167.807     0.999023       814706      1024.00
   50167.807     0.999121       814706      1137.78
   50167.807     0.999219       814706      1280.00
   50167.807     0.999316       814706      1462.86
   50200.575     0.999414       815155      1706.67
   50200.575     0.999512       815155      2048.00
   50200.575     0.999561       815155      2275.56
   50200.575     0.999609       815155      2560.00
   50200.575     0.999658       815155      2925.71
   50200.575     0.999707       815155      3413.33
   50200.575     0.999756       815155      4096.00
   50200.575     0.999780       815155      4551.11
   50200.575     0.999805       815155      5120.00
   50200.575     0.999829       815155      5851.43
   50200.575     0.999854       815155      6826.67
   50200.575     0.999878       815155      8192.00
   50200.575     0.999890       815155      9102.22
   50233.343     0.999902       815242     10240.00
   50233.343     1.000000       815242          inf
#[Mean    =    29266.261, StdDeviation   =    12102.812]
#[Max     =    50200.576, Total count    =       815242]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  978315 requests in 1.00m, 1.17GB read
Requests/sec:  16305.17
Transfer/sec:     20.01MB