src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Wrk/wrkStandardExample2.txt
Running 30s test @ http://10.1.0.13/index.html
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.137ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.015ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.54ms    0.86ms   9.76ms   70.18%
    Req/Sec     1.05k     1.39k    5.55k    89.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.43ms
 75.000%    1.98ms
 90.000%    2.68ms
 99.000%    3.96ms
 99.900%    6.93ms
 99.990%    8.99ms
 99.999%    9.77ms
100.000%    9.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.175     0.000000            1         1.00
       0.566     0.100000         3954         1.11
       0.776     0.200000         7913         1.25
       1.003     0.300000        11866         1.43
       1.226     0.400000        15800         1.67
       1.427     0.500000        19773         2.00
       1.517     0.550000        21738         2.22
       1.610     0.600000        23711         2.50
       1.715     0.650000        25678         2.86
       1.837     0.700000        27663         3.33
       1.982     0.750000        29634         4.00
       2.067     0.775000        30635         4.44
       2.163     0.800000        31614         5.00
       2.261     0.825000        32598         5.71
       2.381     0.850000        33586         6.67
       2.519     0.875000        34567         8.00
       2.601     0.887500        35060         8.89
       2.683     0.900000        35553        10.00
       2.769     0.912500        36051        11.43
       2.867     0.925000        36538        13.33
       2.981     0.937500        37038        16.00
       3.047     0.943750        37281        17.78
       3.105     0.950000        37534        20.00
       3.163     0.956250        37773        22.86
       3.235     0.962500        38022        26.67
       3.327     0.968750        38271        32.00
       3.375     0.971875        38392        35.56
       3.435     0.975000        38515        40.00
       3.507     0.978125        38636        45.71
       3.589     0.981250        38765        53.33
       3.689     0.984375        38886        64.00
       3.749     0.985938        38946        71.11
       3.825     0.987500        39008        80.00
       3.911     0.989062        39068        91.43
       4.011     0.990625        39130       106.67
       4.167     0.992188        39193       128.00
       4.271     0.992969        39223       142.22
       4.383     0.993750        39255       160.00
       4.535     0.994531        39284       182.86
       4.719     0.995313        39315       213.33
       4.967     0.996094        39346       256.00
       5.087     0.996484        39364       284.44
       5.383     0.996875        39377       320.00
       5.623     0.997266        39392       365.71
       5.851     0.997656        39408       426.67
       6.087     0.998047        39423       512.00
       6.195     0.998242        39431       568.89
       6.331     0.998437        39439       640.00
       6.543     0.998633        39446       731.43
       6.663     0.998828        39454       853.33
       7.011     0.999023        39462      1024.00
       7.351     0.999121        39466      1137.78
       7.511     0.999219        39470      1280.00
       7.603     0.999316        39473      1462.86
       7.687     0.999414        39477      1706.67
       7.951     0.999512        39481      2048.00
       8.099     0.999561        39484      2275.56
       8.115     0.999609        39485      2560.00
       8.207     0.999658        39487      2925.71
       8.335     0.999707        39489      3413.33
       8.599     0.999756        39491      4096.00
       8.631     0.999780        39492      4551.11
       8.783     0.999805        39493      5120.00
       8.927     0.999829        39494      5851.43
       8.983     0.999854        39495      6826.67
       8.991     0.999878        39496      8192.00
       8.991     0.999890        39496      9102.22
       9.231     0.999902        39497     10240.00
       9.231     0.999915        39497     11702.86
       9.271     0.999927        39498     13653.33
       9.271     0.999939        39498     16384.00
       9.271     0.999945        39498     18204.44
       9.503     0.999951        39499     20480.00
       9.503     0.999957        39499     23405.71
       9.503     0.999963        39499     27306.67
       9.503     0.999969        39499     32768.00
       9.503     0.999973        39499     36408.89
       9.767     0.999976        39500     40960.00
       9.767     1.000000        39500          inf
#[Mean    =        1.537, StdDeviation   =        0.861]
#[Max     =        9.760, Total count    =        39500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  483.00us
 75.000%    1.12ms
 90.000%    1.71ms
 99.000%    2.87ms
 99.900%    5.76ms
 99.990%    8.02ms
 99.999%    8.41ms
100.000%    8.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.135     0.000000            1         1.00
       0.242     0.100000         4008         1.11
       0.287     0.200000         7981         1.25
       0.335     0.300000        11912         1.43
       0.392     0.400000        15829         1.67
       0.483     0.500000        19763         2.00
       0.552     0.550000        21732         2.22
       0.652     0.600000        23706         2.50
       0.802     0.650000        25676         2.86
       0.959     0.700000        27650         3.33
       1.115     0.750000        29633         4.00
       1.200     0.775000        30626         4.44
       1.285     0.800000        31612         5.00
       1.375     0.825000        32597         5.71
       1.475     0.850000        33586         6.67
       1.586     0.875000        34567         8.00
       1.645     0.887500        35064         8.89
       1.713     0.900000        35550        10.00
       1.788     0.912500        36050        11.43
       1.872     0.925000        36541        13.33
       1.964     0.937500        37032        16.00
       2.018     0.943750        37282        17.78
       2.081     0.950000        37532        20.00
       2.147     0.956250        37779        22.86
       2.219     0.962500        38023        26.67
       2.301     0.968750        38268        32.00
       2.353     0.971875        38395        35.56
       2.397     0.975000        38514        40.00
       2.459     0.978125        38638        45.71
       2.531     0.981250        38761        53.33
       2.625     0.984375        38888        64.00
       2.679     0.985938        38945        71.11
       2.741     0.987500        39007        80.00
       2.821     0.989062        39068        91.43
       2.907     0.990625        39130       106.67
       3.029     0.992188        39193       128.00
       3.119     0.992969        39223       142.22
       3.209     0.993750        39254       160.00
       3.371     0.994531        39284       182.86
       3.583     0.995313        39315       213.33
       3.793     0.996094        39346       256.00
       3.943     0.996484        39363       284.44
       4.175     0.996875        39377       320.00
       4.423     0.997266        39392       365.71
       4.703     0.997656        39408       426.67
       5.007     0.998047        39423       512.00
       5.163     0.998242        39431       568.89
       5.223     0.998437        39439       640.00
       5.355     0.998633        39446       731.43
       5.651     0.998828        39454       853.33
       5.783     0.999023        39462      1024.00
       5.887     0.999121        39466      1137.78
       5.971     0.999219        39470      1280.00
       6.075     0.999316        39473      1462.86
       6.147     0.999414        39477      1706.67
       6.715     0.999512        39481      2048.00
       6.963     0.999561        39483      2275.56
       7.059     0.999609        39485      2560.00
       7.195     0.999658        39487      2925.71
       7.295     0.999707        39489      3413.33
       7.423     0.999756        39491      4096.00
       7.571     0.999780        39492      4551.11
       7.687     0.999805        39493      5120.00
       7.739     0.999829        39494      5851.43
       7.823     0.999854        39495      6826.67
       8.015     0.999878        39496      8192.00
       8.015     0.999890        39496      9102.22
       8.163     0.999902        39497     10240.00
       8.163     0.999915        39497     11702.86
       8.223     0.999927        39498     13653.33
       8.223     0.999939        39498     16384.00
       8.223     0.999945        39498     18204.44
       8.399     0.999951        39499     20480.00
       8.399     0.999957        39499     23405.71
       8.399     0.999963        39499     27306.67
       8.399     0.999969        39499     32768.00
       8.399     0.999973        39499     36408.89
       8.407     0.999976        39500     40960.00
       8.407     1.000000        39500          inf
#[Mean    =        0.782, StdDeviation   =        0.678]
#[Max     =        8.400, Total count    =        39500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58902 requests in 30.00s, 18.31MB read
  Non-2xx or 3xx responses: 58902
Requests/sec:   1963.39
Transfer/sec:    624.98KB